Documents/ПланРуководителя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>ПланРуководителя</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокСтатей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Родитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДоходовРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статья</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДоходовРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПланРуководителя/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	ПодпискиНаСобытия.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаГруппыСтатейСтатьяНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.РасшифровкаГруппыСтатей.ТекущиеДанные;
	
	ПараметрыОтбора = Новый Структура("Родитель", ТекущаяСтатья);
	ПараметрыФормы = Новый Структура("Отбор", ПараметрыОтбора);
	
	ВыбраннаяСтатья = ОткрытьФормуМодально("Справочник.Статьи.ФормаВыбора", ПараметрыФормы);
	Если ЗначениеЗаполнено(ВыбраннаяСтатья) Тогда
		ТекущиеДанные.Статья = ВыбраннаяСтатья;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Объект.Дата = НачалоМесяца(Объект.Дата);
	СформироватьОтчет();
		
КонецПроцедуры

&НаКлиенте
Функция СформироватьОтчет()

	СформироватьОтчетНаСервере(Объект.Дата, Объект.Подразделение);

КонецФункции // СформироватьОтчет()()

&НаСервере
Функция СформироватьОтчетНаСервере(Дата, Подразделение)

	//Получаем схему из макета
	СхемаКомпоновкиДанных = Отчеты.ПланФактныйАнализ.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	//Из схемы возьмем настройки по умолчанию
	Настройки = СхемаКомпоновкиДанных.ВариантыНастроек.ДляПлана.Настройки;
	
	ПараметрПериодОтчета = Настройки.ПараметрыДанных.Элементы.Найти("ПериодОтчета");
	НачалоПериодаОтчета = НачалоМесяца(ДобавитьМесяц(Дата, -3));
	КонецПериодаОтчета = КонецМесяца(Дата);
	
	ПараметрПериодОтчета.Значение = Новый СтандартныйПериод(НачалоПериодаОтчета, КонецПериодаОтчета);
	
	ОтборПодразделение = Настройки.Отбор.Элементы.Получить(0);
	ОтборПодразделение.ПравоеЗначение = Подразделение;
	ОтборПодразделение.Использование = Истина;
	
	//Помещаем в переменную данные о расшифровке данных
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	//Формируем макет, с помощью компоновщика макета
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	//Передаем в макет компоновки схему, настройки и данные расшифровки
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,Настройки, ДанныеРасшифровки);
	
	//Выполним компоновку с помощью процессора компоновки
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,,ДанныеРасшифровки);
	
	//Выводим результат в табличный документ
	ОтчетПоСтатьям.Очистить();
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ОтчетПоСтатьям);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);	
	
КонецФункции // ПолучитьОтчет()

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	СформироватьОтчет();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Дата) Тогда
		ДатаОтчета = Объект.Дата;
	Иначе
		ДатаОтчета = ТекущаяДата();
	КонецЕсли;
	
	СформироватьОтчетНаСервере(ДатаОтчета, Объект.Подразделение);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Статьи.Ссылка КАК ГруппаСтатей,
	|	СУММА(ПланРуководителяСписокСтатей.Сумма) КАК Сумма
	|ИЗ
	|	Справочник.Статьи КАК Статьи
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПланРуководителя.СписокСтатей КАК ПланРуководителяСписокСтатей
	|		ПО (ПланРуководителяСписокСтатей.Родитель = Статьи.Ссылка)
	|			И (ПланРуководителяСписокСтатей.Ссылка = &Ссылка)
	|ГДЕ
	|	Статьи.ЭтоГруппа
	|	И Статьи.ВидСтатьи = ЗНАЧЕНИЕ(Перечисление.ВидСтатьи.Расход)
	|
	|СГРУППИРОВАТЬ ПО
	|	Статьи.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Статьи.НомерКолонки";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	ГруппыСтатей.Загрузить(Запрос.Выполнить().Выгрузить());
    ИтогПоСтатьям = ГруппыСтатей.Итог("Сумма");
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущаяСтатьяПриИзменении(Элемент)
	
	УстановитьОтборПоСтатье(ТекущаяСтатья);
	
КонецПроцедуры

&НаКлиенте
Функция УстановитьОтборПоСтатье(Статья)
	
	Если ЗначениеЗаполнено(Статья) Тогда
		ОтборСтрок = Новый ФиксированнаяСтруктура("Родитель", Статья);
	Иначе
		ОтборСтрок = Новый ФиксированнаяСтруктура("Родитель", Неопределено);
	КонецЕсли;
	
	Элементы.СписокСтатей.ОтборСтрок = ОтборСтрок;

КонецФункции // УстановитьОтборПоСтатье()

&НаКлиенте
Функция ПересчитатьГруппы()

	// не нравится мне вложенный цикл
	// но придумать сейчас не могу
	// забыл как делал пару дней назад :(
	
	// хоть и не так много строк в документах,
	// всё равно не по себе от такого решения
	
	Для каждого СтрокаГруппы из ГруппыСтатей Цикл
		
		СуммаГруппы = 0;
		
		Для каждого СтрокаСтатья Из Объект.СписокСтатей Цикл
		
			Если СтрокаГруппы.ГруппаСтатей = СтрокаСтатья.Родитель Тогда
				СуммаГруппы = СтрокаСтатья.Сумма + СуммаГруппы;
			КонецЕсли;
		
		КонецЦикла;
		
		СтрокаГруппы.Сумма = СуммаГруппы;
		
	КонецЦикла;

    ИтогПоСтатьям = ГруппыСтатей.Итог("Сумма");

КонецФункции // ПересчитатьГруппы()

&НаКлиенте
Процедура СписокСтатейПриИзменении(Элемент)
	
	ПересчитатьГруппы();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппыСтатейПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ГруппыСтатей.ТекущиеДанные;
	ТекущаяСтатья = ТекущиеДанные.ГруппаСтатей;
	
	УстановитьОтборПоСтатье(ТекущаяСтатья);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокСтатейСтатьяНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Отбор = Новый Структура;
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	
	Если ЗначениеЗаполнено(ТекущаяСтатья) Тогда
		Отбор.Вставить("Родитель", ТекущаяСтатья);
	КонецЕсли;
	
	ТекущиеДанные = Элементы.СписокСтатей.ТекущиеДанные;
	ВыбраннаяСтатья = ОткрытьФормуМодально("Справочник.Статьи.Форма.ФормаВыбора", ПараметрыФормы);
	
	Если ЗначениеЗаполнено(ВыбраннаяСтатья) Тогда
		ТекущиеДанные.Статья = ВыбраннаяСтатья;
		ТекущиеДанные.Родитель = ЛексСервер.ЗначениеРеквизитаОбъекта(ВыбраннаяСтатья, "Родитель");
	КонецЕсли;
	
КонецПроцедуры
